Divisions/Bayerdevponomarev.RA_Divisions/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>RA_AdditionalFields_DChainSpecStatus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_MaterialGroup</name>
    <type>
      <types>CatalogRef.RA_AdditionalFields_MaterialGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_MaterialType</name>
    <type>
      <types>CatalogRef.RA_AdditionalFields_MaterialTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_ProfitCentre</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_PurchasingGroup</name>
    <type>
      <types>CatalogRef.RA_AdditionalFields_PurchasingGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_PurchasingOrganization</name>
    <type>
      <types>CatalogRef.RA_AdditionalFields_PurchasingOrganizations</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_ValidFrom</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_XPlantMatlStatus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_XPlntMatlValidFrom</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_ДополнительноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_КодSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Divisions/Bayerdevponomarev.RA_Divisions/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура RA_AdditionalFieldsПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	RA_AdditionalFields_ДобавитьЭлементыНаФорму();	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура RA_AdditionalFields_ДобавитьЭлементыНаФорму()
	
	//Добавим группу Bayer
	ГруппаBayer = Элементы.Добавить("РА_ГруппаBayer", Тип("ГруппаФормы"), Элементы.ГруппаШапка);
	ГруппаBayer.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//@skip-check wrong-type-expression
	ГруппаBayer.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаBayer.ОтображатьЗаголовок = Истина;
	ГруппаBayer.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаBayer.Заголовок = "Bayer";
	ГруппаBayer.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	ГруппаBayer.Поведение = ПоведениеОбычнойГруппы.Свертываемая; 
	ГруппаBayer.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	ГруппаBayer.Скрыть();

	НовыйЭлемент = Элементы.Добавить("RA_ДополнительноеНаименование", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_ДополнительноеНаименование";

	НовыйЭлемент = Элементы.Добавить("RA_КодSAP", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_КодSAP";

	НовыйЭлемент = Элементы.Добавить("RA_ProfitCentre", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_ProfitCentre";
	
	НовыйЭлемент = Элементы.Добавить("RA_Division", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_ProfitCentre.RA_AdditionalFields_Division";
	
	НовыйЭлемент = Элементы.Добавить("RA_PurchasingOrganization", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_PurchasingOrganization";
	
	НовыйЭлемент = Элементы.Добавить("RA_PurchasingGroup", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_PurchasingGroup";
	
	НовыйЭлемент = Элементы.Добавить("RA_DChainSpecStatus", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_DChainSpecStatus";
	
	НовыйЭлемент = Элементы.Добавить("RA_ValidFrom", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_ValidFrom";
	
	НовыйЭлемент = Элементы.Добавить("RA_XPlantMatlStatus", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_XPlantMatlStatus";
	
	НовыйЭлемент = Элементы.Добавить("RA_XPlntMatlValidFrom", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_XPlntMatlValidFrom";
	
	НовыйЭлемент = Элементы.Добавить("RA_MaterialType", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_MaterialType";
	
	НовыйЭлемент = Элементы.Добавить("RA_MaterialGroup", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_MaterialGroup";
		
КонецПроцедуры

#КонецОбласти
